---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewIntersectionResultArray
source: html/601215bc-cbf6-34e5-c189-7a133c2b1230.htm
---
# Autodesk.Revit.Creation.Application.NewIntersectionResultArray Method

Creates a new instance of an IntersectionResult array.

## Syntax (C#)
```csharp
public IntersectionResultArray NewIntersectionResultArray()
```